TxBlackWolf/quadcopter/flight-controller/src/hal/stm32f4/stm32f4_gpio_functions.h
//---------------------------------------------------------------------------------------------------------------
//
// Filename   : stm32f4_gpio_functions.h
// Author     : Kuba Sejdak
// Created on : 23.08.2015
//
// This file is a part of SkyViper project.
//
// %LICENSE%
//
//---------------------------------------------------------------------------------------------------------------

#ifndef STM32F4_GPIO_FUNCTIONS_H
#define STM32F4_GPIO_FUNCTIONS_H

#define GPIO_DIGITAL_PIN    -1

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 0
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_RTC_50Hz    0
#define GPIO_AF_MCO         0
#define GPIO_AF_TAMPER      0
#define GPIO_AF_SWJ         0
#define GPIO_AF_TRACE       0

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 1
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_TIM1        1
#define GPIO_AF_TIM2        1
//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 2
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_TIM3        2
#define GPIO_AF_TIM4        2
#define GPIO_AF_TIM5        2

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 3
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_TIM8        3
#define GPIO_AF_TIM9        3
#define GPIO_AF_TIM10       3
#define GPIO_AF_TIM11       3

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 4
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_I2C1        4
#define GPIO_AF_I2C2        4
#define GPIO_AF_I2C3        4

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 5
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_SPI1        5
#define GPIO_AF_SPI2        5

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 6
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_SPI3        6

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 7
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_USART1      7
#define GPIO_AF_USART2      7
#define GPIO_AF_USART3      7
#define GPIO_AF_I2S3ext     7

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 8
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_UART4       8
#define GPIO_AF_UART5       8
#define GPIO_AF_USART6      8

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 9
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_CAN1        9
#define GPIO_AF_CAN2        9
#define GPIO_AF_TIM12       9
#define GPIO_AF_TIM13       9
#define GPIO_AF_TIM14       9

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 10
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_OTG_FS      10
#define GPIO_AF_OTG_HS      10

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 11
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_ETH         11

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 12
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_FSMC        12
#define GPIO_AF_OTG_HS_FS   12
#define GPIO_AF_SDIO        12

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 13
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_DCMI        13

//---------------------------------------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS 15
//---------------------------------------------------------------------------------------------------------------

#define GPIO_AF_EVENTOUT    15

#endif
